## Terraform Plan Results 🏗️

**Environment:** `development`
**Workspace:** `development-platform-eks`
**Directory:** `terraform/env-development/platform-layer/eks-auto-mode`

### Format Check: ✅ Passed
### Init: ✅ Passed
### Validate: ✅ Passed
### Plan: ✅ Success

<details>
<summary>Show Plan Output</summary>

```hcl
To view this run in a browser, visit:
https://app.terraform.io/app/Datafaced/development-platform-eks/runs/run-YHt8XESCZdNpveqc

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_access_entry.sso_admins will be created
  + resource "aws_eks_access_entry" "sso_admins" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "dev-eks-auto"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::126350206316:role/aws-reserved/sso.amazonaws.com/ap-southeast-2/AWSReservedSSO_AdministratorAccess_f2797e9b77c9c51a"
      + region            = "ap-southeast-2"
      + tags              = {
          + "Cluster"  = "dev-eks-auto"
          + "Name"     = "dev-eks-auto-sso-admins"
          + "UserRole" = "Administrator"
        }
      + tags_all          = {
          + "Cluster"     = "dev-eks-auto"
          + "Environment" = "Development"
          + "Layer"       = "Platform"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-eks-auto-sso-admins"
          + "Owner"       = "Platform-Team"
          + "Project"     = "eks-auto-mode"
          + "UserRole"    = "Administrator"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # aws_eks_access_entry.sso_developers will be created
  + resource "aws_eks_access_entry" "sso_developers" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "dev-eks-auto"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::126350206316:role/aws-reserved/sso.amazonaws.com/ap-southeast-2/AWSReservedSSO_DeveloperAccess_d2fea248b1a63e2f"
      + region            = "ap-southeast-2"
      + tags              = {
          + "Cluster"  = "dev-eks-auto"
          + "Name"     = "dev-eks-auto-sso-developers"
          + "UserRole" = "Developer"
        }
      + tags_all          = {
          + "Cluster"     = "dev-eks-auto"
          + "Environment" = "Development"
          + "Layer"       = "Platform"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-eks-auto-sso-developers"
          + "Owner"       = "Platform-Team"
          + "Project"     = "eks-auto-mode"
          + "UserRole"    = "Developer"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # aws_eks_access_entry.sso_platform_engineers will be created
  + resource "aws_eks_access_entry" "sso_platform_engineers" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "dev-eks-auto"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::126350206316:role/aws-reserved/sso.amazonaws.com/ap-southeast-2/AWSReservedSSO_PlatformEngineerAccess_bf44c7881c2ddf7c"
      + region            = "ap-southeast-2"
      + tags              = {
          + "Cluster"  = "dev-eks-auto"
          + "Name"     = "dev-eks-auto-sso-platform-engineers"
          + "UserRole" = "PlatformEngineer"
        }
      + tags_all          = {
          + "Cluster"     = "dev-eks-auto"
          + "Environment" = "Development"
          + "Layer"       = "Platform"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-eks-auto-sso-platform-engineers"
          + "Owner"       = "Platform-Team"
          + "Project"     = "eks-auto-mode"
          + "UserRole"    = "PlatformEngineer"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # aws_eks_access_policy_association.sso_admins will be created
  + resource "aws_eks_access_policy_association" "sso_admins" {
      + associated_at = (known after apply)
      + cluster_name  = "dev-eks-auto"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::126350206316:role/aws-reserved/sso.amazonaws.com/ap-southeast-2/AWSReservedSSO_AdministratorAccess_f2797e9b77c9c51a"
      + region        = "ap-southeast-2"

      + access_scope {
          + type = "cluster"
        }
    }

  # aws_eks_access_policy_association.sso_developers will be created
  + resource "aws_eks_access_policy_association" "sso_developers" {
      + associated_at = (known after apply)
      + cluster_name  = "dev-eks-auto"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSEditPolicy"
      + principal_arn = "arn:aws:iam::126350206316:role/aws-reserved/sso.amazonaws.com/ap-southeast-2/AWSReservedSSO_DeveloperAccess_d2fea248b1a63e2f"
      + region        = "ap-southeast-2"

      + access_scope {
          + namespaces = [
              + "default",
              + "dev",
            ]
          + type       = "namespace"
        }
    }

  # aws_eks_access_policy_association.sso_platform_engineers will be created
  + resource "aws_eks_access_policy_association" "sso_platform_engineers" {
      + associated_at = (known after apply)
      + cluster_name  = "dev-eks-auto"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::126350206316:role/aws-reserved/sso.amazonaws.com/ap-southeast-2/AWSReservedSSO_PlatformEngineerAccess_bf44c7881c2ddf7c"
      + region        = "ap-southeast-2"

      + access_scope {
          + type = "cluster"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ access_entry_principals            = {
      ~ administrators     = "arn:aws:iam::126350206316:role/aws-reserved/sso.amazonaws.com/ap-southeast-2/AWSReservedSSO_AdministratorAccess_*" -> "arn:aws:iam::126350206316:role/aws-reserved/sso.amazonaws.com/ap-southeast-2/AWSReservedSSO_AdministratorAccess_f2797e9b77c9c51a"
      ~ developers         = "arn:aws:iam::126350206316:role/aws-reserved/sso.amazonaws.com/ap-southeast-2/AWSReservedSSO_DeveloperAccess_*" -> "arn:aws:iam::126350206316:role/aws-reserved/sso.amazonaws.com/ap-southeast-2/AWSReservedSSO_DeveloperAccess_d2fea248b1a63e2f"
      ~ platform_engineers = "arn:aws:iam::126350206316:role/aws-reserved/sso.amazonaws.com/ap-southeast-2/AWSReservedSSO_PlatformEngineerAccess_*" -> "arn:aws:iam::126350206316:role/aws-reserved/sso.amazonaws.com/ap-southeast-2/AWSReservedSSO_PlatformEngineerAccess_bf44c7881c2ddf7c"
    }

Run status: planned and saved (confirmable)
Workspace is unlocked

```

</details>

---
*Workflow: `Terraform: Dev Platform EKS` | Run: [19983446940](https://github.com/dr3dr3/terraform/actions/runs/19983446940)*